combustion/fireFoam/RAS/stecklerWithSpray/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    out
    {
        type            inletOutlet;
        inletValue      uniform 301.15;
        value           uniform 301.15;
    }
    outSide
    {
        type            inletOutlet;
        inletValue      uniform 301.15;
        value           uniform 301.15;
    }
    sides
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 301.15;
        h               uniform 10;
        kappaMethod     fluidThermo;
        thicknessLayers ( 0.013 );
        kappaLayers     ( 0.1 );
        value           uniform 301.15;
    }
    floor
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 301.15;
        h               uniform 10;
        kappaMethod     fluidThermo;
        thicknessLayers ( 0.013 );
        kappaLayers     ( 0.1 );
        value           uniform 301.15;
    }
    walls
    {
        type            externalWallHeatFluxTemperature;
        mode            coefficient;
        Ta              uniform 301.15;
        h               uniform 10;
        kappaMethod     fluidThermo;
        thicknessLayers ( 0.013 );
        kappaLayers     ( 0.1 );
        value           uniform 301.15;
    }
    burner
    {
        type            fixedValue;
        value           uniform 298.15;
    }
}

// ************************************************************************* //
