combustion/fireFoam/RAS/stecklerWithSpray/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    out
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    outSide
    {
        type            inletOutlet;
        inletValue      uniform 0.0001;
        value           uniform 0.0001;
    }
    sides
    {
        type            kqRWallFunction;
        value           uniform 0.0001;
    }
    floor
    {
        type            kqRWallFunction;
        value           uniform 0.0001;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.0001;
    }
    burner
    {
        type            fixedValue;
        value           uniform 0.0001;
    }
}

// ************************************************************************* //
