combustion/fireFoam/RAS/stecklerWithSpray/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    out
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    outSide
    {
        type            inletOutlet;
        inletValue      uniform 0.01;
        value           uniform 0.01;
    }
    sides
    {
        type            omegaWallFunction;
        value           uniform 0.01;
    }
    floor
    {
        type            omegaWallFunction;
        value           uniform 0.01;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform 0.01;
    }
    burner
    {
        type            fixedValue;
        value           uniform 0.01;
    }
}

// ************************************************************************* //
