combustion/fireFoam/RAS/stecklerWithSpray/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    out
    {
        type            calculated;
        value           uniform 101325;
    }
    outSide
    {
        type            calculated;
        value           uniform 101325;
    }
    sides
    {
        type            calculated;
        value           uniform 101325;
    }
    floor
    {
        type            calculated;
        value           uniform 101325;
    }
    walls
    {
        type            calculated;
        value           uniform 101325;
    }
    burner
    {
        type            calculated;
        value           uniform 101325;
    }
}

// ************************************************************************* //
