combustion/fireFoam/RAS/stecklerWithSpray/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "out|outSide"
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }
    sides
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           $internalField;
    }
    floor
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           $internalField;
    }
    walls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           $internalField;
    }
    burner
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           $internalField;
    }
}

// ************************************************************************* //
