combustion/fireFoam/RAS/stecklerWithSpray/system/FO/fluxSummary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxSummaryDoors
{
    type        fluxSummary;
    libs        ("libfieldFunctionObjects.so");
    write       yes;
    log         yes;
    mode        faceZoneAndDirection;
    faceZoneAndDirection
    (
        (doorOpening (1 0 0)) 
    );
    scaleFactor 1.0;
}
