combustion/fireFoam/RAS/stecklerWithSpray/system/FO/minMax
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMinMax
{
    type                fieldMinMax;
    libs  ("libfieldFunctionObjects.so");
    log                 yes;
    writeControl        timeStep;
    writeInterval       10;
    mode                magnitude;
    fields              ( U T p p_rgh );
}
