combustion/fireFoam/RAS/stecklerWithSpray/system/FO/probe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

puTprobes
{
    libs ("libsampling.so");
    type            probes;
    name            probes;
    writeControl    timeStep;
    writeInterval   1;
    fields          ( p U T );
    
    probeLocations
    (
    ( 0 0.00 0 ) 
    ( 0 0.25 0 ) 
    ( 0 0.50 0 )
    ( 0 0.75 1 )
    ( 0 1.20 1 )
    
    );
}

probeDoors
{
    libs ("libsampling.so");
    type            probes;
    name            probeDoors;
    writeControl    timeStep;
    writeInterval   1;
    fields          ( p U T );
    
    probeLocations
    (
    ( 0.0 0.10 0.0 ) 
    ( 0.0 0.25 0.0 ) 
    ( 0.0 0.50 0.0 )
    ( 0.0 1.10 0.0 )
    
    );
}
