combustion/fireFoam/RAS/stecklerWithSpray/system/FO/sampling
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

sampled
{
    type    surfaces;
    libs    (sampling);
    log     true;

    executeControl  runTime;
    executeInterval 1;
    writeControl    runTime;
    writeInterval   1;

    surfaceFormat   ensight;
    formatOptions
    {
        ensight
        {
            collated true;
        }
    }

    fields      (U T TMean UMean);

    surfaces
    {
        plane1
        {
            type    plane;
            source  cells;

            point   (0 0 0);
            normal  (0 0 1);
        }
    }
}
