combustion/fireFoam/RAS/stecklerWithSpray/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|rhoFinal)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    p_rgh
    {
        solver              GAMG;
        tolerance           1e-7;
        relTol              0.01;
        smoother            GaussSeidel;
        cacheAgglomeration  true;
        nCellsInCoarsestLevel   10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance           1e-7;
        relTol              0;
    }

    "(U|h|k|omega|Yi|O2|N2|H2O)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.1;
    }
    "(U|h|k|omega|Yi|O2|N2|H2O)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
    }

    Ii
    {
        solver                  GAMG;
        tolerance               1e-4;
        relTol                  0;
        smoother                symGaussSeidel;
        cacheAgglomeration      true;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        mergeLevels             1;
        maxIter                 20;
    }

}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       4;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        U                   0.9;
        "CH4|O2|H2O|CO2"    1.0;
        hs                  0.9;
        "k|omega"           0.9;
        rho                 1.0;
        ".*Final"           1.0;
    }
    
}

// ************************************************************************* //
