combustion/fireFoam/RAS/stecklerWithSpray/system/solverControls.80
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

writeInterval   40;

maxCo           0.3;

maxDeltaT       1e-2;


// ************************************************************************* //
