combustion/fireFoam/RAS/stecklerWithSpray/system/topoSetDictBurner
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    // Load initial faceSet
    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch floor;
        }
    }

    // extract normal faces
    {
        name    f0;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box  (-0.135 -0.135 -0.135) (0.135 0.135 0.135);
        }
    }

    // heat source zone
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-0.135 -0.1 -0.135) ( 0.135 0.2 0.135);
        }
    }

    {
        name    HRRzone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c0;
        }
    }

    // write faceZoneSet
    {
        name    burner;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet f0;
        }
    }
);

// ************************************************************************* //
