combustion/fireFoam/RAS/stecklerWithSpray/system/topoSetDictCompartment
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch floor;
        }
    }

    {
        name    f0;
        type    faceSet;
        action  subset;
        source boxToFace;
        sourceInfo
        {
            // floor dimensions (must be same as compartment dimensions below)
            box   (-1.4 0 -1.4) (1.4 2.13 1.4);
        }
    }

    {
        name    f0;
        type    faceSet;
        action  delete;
        source faceToFace;
        sourceInfo
        {
            set burner;
        }
    }

    // write faceZoneSet
    {
        name    floor;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet f0;
        }
    }

    // -------------- Compartment Walls & Top ------------------//

    // Load initial cellSet
    {
        name    c0;
        type    cellSet;
        action  new;
        source boxToCell;
        sourceInfo
        {
           // compartment dimensions (must be same as floor dimensions above)
           box   (-1.4 0 -1.4) (1.4 2.18 1.4);
        }
    }

    {
        name    f0;
        type    faceSet;
        action  new;
        source cellToFace;
        sourceInfo
        {
            set c0;
            option all;
        }
    }

    // invert initial cellSet
    {
        name    c0;
        type    cellSet;
        action  invert;
    }

    {
        name    f1;
        type    faceSet;
        action  new;
        source cellToFace;
        sourceInfo
        {
            set c0;
            option all;
        }
    }

    {
        name    f0;
        type    faceSet;
        action  subset;
        source  faceToFace;
        sourceInfo
        {
            set f1;
        }
    }

    // delete doorway faces
    {
        name    f0;
        type    faceSet;
        action  delete;
        source  boxToFace;
        sourceInfo
        {
            // doorway dimensions 6/6: width:0.74; 1.83 height
            box  (1.39 0 -.37) (1.41 1.83 .37);
        }
    }
    // crete doorway faceZone
    {
        name    faceSetDoors;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            // doorway dimensions 6/6: width:0.74; 1.83 height
            box  (1.399 0 -.37) (1.401 1.83 .37);
        }
    }
    {
        name    doorOpening;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet faceSetDoors;
        }
    }

    // write faceZoneSet
    {
        name    compartment;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet f0;
        }
    }

);

// ************************************************************************* //
